## [결측치 缺測値 Missing Value 처리 ]
- 데이터 미입력 또는 데이터 저장 과정에서 지워진 데이터.
- 빈칸 의미
- 표기 : NaN(Not A Number), NaT(Not A Text)
- numpy 모듈의 nan, math모듈의 nan 쓰기.

(1) 모듈 로딩 <hr>

In [12]:
import pandas as pd

(2) 데이터 준비<hr>

In [13]:
file = '../DATA/employees.csv'

(3) 데이터 저장 : CSV -> DF <hr>

데이터 파일 확인하기. 
- 가장 먼저 맨 첫 줄이 열 이름이 맞는지 확인!
- 열 중에서 행인덱스로 변환할 만한 것이 있는지 확인!
- 구분자 확인(예- 쉼표, 세미콜론)

In [14]:
# 구분자  : ,           헤더 : 첫번째 줄 컬럼명.
empDF = pd.read_csv(file)

(4) 데이터 확인

In [15]:
# 데이터의 전반적인 요약정보 확인 => info() 메서드
# 컬럼별 결측치 여부 확인 => 실제 데이터에서 결측치 체크 & 처리
# 컬럼별 데이터 타입과 실제 데이터 타입 비교 ==> 타입 다른 경우, 타입 전환.
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    object
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

- 데이터의 컬럼별 분포 확인 => describe() : 컬럼별 기술 통계값 확인 가능

In [16]:
empDF.describe() #수치 데이터만 계산

              Salary
count     999.000000
mean    90655.528529
std     32939.511615
min     35013.000000
25%     62560.000000
50%     90427.000000
75%    118744.500000
max    149908.000000

In [22]:
# 최빈값 => mode(), 중앙값 => median(), 평균 => mean() # 괄호 안에 numeric_only를 넣어서 수치데이터만 빼와서 실행.
print(empDF.mode(numeric_only=True),
      empDF.median(numeric_only=True), 
      empDF.mean(numeric_only=True), sep = '\n\n')

     Salary
0   86676.0
1   91462.0
2  121160.0
3  145988.0
4  147183.0

Salary    90427.0
dtype: float64

Salary    90655.528529
dtype: float64

In [25]:
# 데이터 타입을 보고 어떻게 처리할 건지 생각!
# 사전처리 --> 데이터처리 / 데이터 변환 (단위 표준화/자료형 표준화)
# 데이터 크기 --> 정규화.

(5) 데이터 전처리(Preprocessing) => 가. 결측치 처리

- 결측치 확인 ==> isna(), isnull() : 원소 단위로 검사 후 결측치인 경우 True 반환

In [26]:
empDF.columns

Index(['First Name', 'Gender', 'Start Date', 'Salary', 'Mgmt', 'Team'], dtype='object')

In [29]:
# 전체 데이터의 컬럼별 결측치 체크
print(empDF.isna().head(), empDF.isnull().head(), sep = '\n\n')

   First Name  Gender  Start Date  Salary   Mgmt   Team
0       False   False       False    True  False  False
1       False   False       False   False  False   True
2       False   False        True   False  False  False
3       False    True       False   False  False  False
4       False   False       False   False  False  False

   First Name  Gender  Start Date  Salary   Mgmt   Team
0       False   False       False    True  False  False
1       False   False       False   False  False   True
2       False   False        True   False  False  False
3       False    True       False   False  False  False
4       False   False       False   False  False  False

In [35]:
# 전체 데이터의 컬럼별 결측치 체크 후 개수 파악 => 합계
print(empDF.isna().sum(), empDF.isnull().sum(), sep ='\n\n')  # null 데이터 개수를 구할 수 있음.

First Name     68
Gender        147
Start Date      2
Salary          2
Mgmt           68
Team           44
dtype: int64

First Name     68
Gender        147
Start Date      2
Salary          2
Mgmt           68
Team           44
dtype: int64

- 결측치 확인 ==> notna() / notnull() : 결측치가 아니면 True 반환.

In [36]:
print(empDF.notna().head(), empDF.notnull().head(), sep='\n\n') # 정상데이터 개수를 구할 수 있음.

   First Name  Gender  Start Date  Salary  Mgmt   Team
0        True    True        True   False  True   True
1        True    True        True    True  True  False
2        True    True       False    True  True   True
3        True   False        True    True  True   True
4        True    True        True    True  True   True

   First Name  Gender  Start Date  Salary  Mgmt   Team
0        True    True        True   False  True   True
1        True    True        True    True  True  False
2        True    True       False    True  True   True
3        True   False        True    True  True   True
4        True    True        True    True  True   True

- 결측치 처리 ==> (1) 삭제 : dropna()

In [38]:
# [기본] 행 안에 NaN이 1개만 있어도 해당 행을 삭제.
empDF2 = empDF.dropna()
empDF2

    First Name  Gender Start Date    Salary   Mgmt          Team
4        Larry    Male    1/24/98  101004.0   True            IT
5       Dennis    Male    4/18/87  115163.0  False         Legal
6         Ruby  Female    8/17/87   65476.0   True       Product
8       Angela  Female   11/22/05   95570.0   True   Engineering
9      Frances  Female     8/8/02  139852.0   True  Business Dev
..         ...     ...        ...       ...    ...           ...
994     George    Male    6/21/13   98874.0   True     Marketing
996    Phillip    Male    1/31/84   42392.0  False       Finance
997    Russell    Male    5/20/13   96914.0  False       Product
998      Larry    Male    4/20/13   60500.0  False  Business Dev
999     Albert    Male    5/15/12  129949.0   True         Sales

[761 rows x 6 columns]

In [41]:
print(empDF.shape, empDF2.shape)

(1001, 6) (761, 6)

In [43]:
## [설정] 행 안의 모든 데이터 즉 값이 NA면 삭제.
empDF3 = empDF.dropna(how = 'all')
print(empDF.shape, empDF3.shape)

(1001, 6) (1000, 6)

In [50]:
## [설정] 특정 열의 NA만 체크 후 삭제.
#예) 성별에 따른 연봉 분석 -> NA면 분석 불가능 컬럼을 지정.
empDF4 = empDF.dropna(subset=['Gender', 'Salary']) #성별/연봉 항목의 값이 NA일 경우 데이터 삭제.
print(empDF.shape, empDF4.shape)

(1001, 6) (853, 6)

In [51]:
## [설정] 컬럼별 정상 데이터 즉 NA가 아닌 데이터의 개수를 지정 후 해당 수만큼 정상 데이터가 없는 컬럼 삭제.
empDF5 = empDF.dropna(thresh=950, axis = 'columns') #thresh = n 정상 데이터(NA가 아닌 데이터)가 n개 이하일 때 데이터를 삭제. (정수/선택적 사용 / how와 같이 쓸 수 없음.)
print(empDF.shape, empDF5.shape, empDF.columns)

(1001, 6) (1001, 3) Index(['First Name', 'Gender', 'Start Date', 'Salary', 'Mgmt', 'Team'], dtype='object')

- 결측치 처리 => 대체 :fillna()

In [53]:
# Gender 컬럼에 결측값을 무엇으로 채울 것인가
empDF.describe(include = 'all').head(3)

       First Name  Gender Start Date  Salary  Mgmt Team
count         933     854        999   999.0   933  957
unique        200       2        971     NaN     2   10
top       Marilyn  Female   10/30/04     NaN  True   IT

In [55]:
# 컬럼의 최빈값으로 na 채우기.(Na에 컬럼의 최빈값 넣기)
empDF.Gender.mode()[0]

'Female'

In [57]:
genSR = empDF.Gender.fillna(empDF.Gender.mode()[0])

In [58]:
genSR.isna().sum()

0

In [61]:
# NA 값 이전과 NA 값 이후 값으로 체우기. -> method = 'ffill' <=> 'bfill'
empDF.Gender.fillna(method = 'ffill')

0         Male
1         Male
2       Female
3       Female
4         Male
         ...
996       Male
997       Male
998       Male
999       Male
1000      Male
Name: Gender, Length: 1001, dtype: object

In [64]:
import numpy as np
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                    [3, 4, np.nan, 1],
                    [np.nan, np.nan, np.nan, np.nan],
                    [np.nan, 3, np.nan, 4]],
                   columns=list("ABCD")) #하나씩 언패킹해서 들어감.
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [68]:
df.A.fillna(method='ffill') # NaN 이전 값을 NaN 값에 넣음.

0    NaN
1    3.0
2    3.0
3    3.0
Name: A, dtype: float64

In [69]:
df.A.fillna(method='ffill', limit = 1) #limit = n : n만큼 채움.(남는 요소가 발생할 수 있음.)

0    NaN
1    3.0
2    3.0
3    NaN
Name: A, dtype: float64

In [72]:
df2 = pd.DataFrame(np.zeros((4, 4)), columns=list("ABCE"))
df.fillna(df2) 
# E와 열 이름이 일치하지 않아서 인덱스가 달라졌고 D열에는 NaN 값이 채워지지 않았다.

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  NaN
3  0.0  3.0  0.0  4.0

In [73]:
# B컬럼과 D 컬럼의 평균으로 결측치 대체.
df.B.fillna(df.B.mean())

0    2.0
1    4.0
2    3.0
3    3.0
Name: B, dtype: float64

In [74]:
df.D.fillna(df.D.mean())

0    0.000000
1    1.000000
2    1.666667
3    4.000000
Name: D, dtype: float64